In [1]:
import pandas as pd
import numpy as np
import random

In [2]:
data = pd.read_csv('data.csv')

In [3]:
data.head()

     name age              email
0  hAkUhk  83  hakuhk@sample.org
1  ySFWNC  56    ysfwnc@test.com
2  UzfFeK  20  uzffek@sample.org
3  hZkiIY  61  hzkiiy@sample.org
4  rIcsVL  79    ricsvl@test.com

In [4]:
data.describe()

           name      age              email
count   1000999  1000999            1000999
unique     1001       83               1001
top      hAkUhk       81  hakuhk@sample.org
freq       1000    21000               1000

Adjunk hozzá egy fizetés sort ami 5000 és 200000 közötti fizetéseket tartalmaz és adjuk meg hogy ez legyen integer típusú

In [5]:
data['fizetes'] = [random.randint(50, 200) for _ in range(len(data))]
data['fizetes'] = data['fizetes'].astype(int)
data.describe()

            fizetes
count  1.000999e+06
mean   1.249505e+02
std    4.359818e+01
min    5.000000e+01
25%    8.700000e+01
50%    1.250000e+02
75%    1.630000e+02
max    2.000000e+02

Az adatot lehet szűrni

In [6]:
data[data['fizetes'] > 100].head()

     name age              email  fizetes
0  hAkUhk  83  hakuhk@sample.org      102
2  UzfFeK  20  uzffek@sample.org      176
3  hZkiIY  61  hzkiiy@sample.org      169
5  KfUfUj  81  kfufuj@sample.org      174
7  zDJLnk  93  zdjlnk@sample.org      104

In [7]:
data['name'] = data['name'].str.upper()
data[data['name'].str.contains('A')].head()

      name age              email  fizetes
0   HAKUHK  83  hakuhk@sample.org      102
9   GXJCAU  42  gxjcau@sample.org      171
16  PJCZDA  25    pjczda@test.com       68
18  CJYERA  37    cjyera@test.com       68
23  NAKUOW  74    nakuow@test.com      143

Rendezés

In [8]:
data.sort_values(by='fizetes', ascending=True).head()

          name age               email  fizetes
56700   UMJYNH  70   umjynh@sample.org       50
738238  ZWRPEM  65   zwrpem@sample.org       50
569525  KHHAQJ  43   khhaqj@sample.org       50
621690  MNLAPN  23  mnlapn@example.com       50
738247  DRDXVE  75  drdxve@example.com       50

In [9]:
#Alapvető műveletek
data['fizetes'].mean()
data['fizetes'].median()
data['fizetes'].std()
data['fizetes'].var()
data['fizetes'].sum()
data['fizetes'].min()
data['fizetes'].max()
data['fizetes'].mode()

0    116
Name: fizetes, dtype: int32

Hiányzó adatok törlése

In [10]:
data.dropna() #NaN értékek törlése
data.fillna(0) #NaN értékek nullával való helyettesítése

data['fizetes'] = data['fizetes'].fillna(data['fizetes'].mean()) #NaN értékek átlagával való helyettesítése

Sorok tisztítása

In [21]:
data['age'].replace(0, np.nan, inplace=True) #0 értékek NaN-ra cserélése
data.drop_duplicates(inplace=True)

data = data[data['age'] != "age"]

data['age'] = data['age'].astype(int)

C:\Users\Benedek\AppData\Local\Temp\ipykernel_2908\1397075626.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  data['age'].replace(0, np.nan, inplace=True) #0 értékek NaN-ra cserélése

In [22]:
data.describe()

                 age        fizetes
count  150791.000000  150791.000000
mean       58.526895     124.998316
std        24.223516      43.586409
min        18.000000      50.000000
25%        37.000000      87.000000
50%        58.000000     125.000000
75%        80.000000     163.000000
max        99.000000     200.000000

In [27]:
data.to_csv('data.csv', index=False)